/*
*********************************************************************************************************
*
*	模块名称 : LED指示灯驱动模块
*	文件名称 : bsp_led.h
*	版    本 : V1.0
*	说    明 : 头文件
*
*	Copyright (C), 2013-2014, 安富莱电子 www.armfly.com
*
*********************************************************************************************************
*/

#ifndef _BSP_LED_H_
#define _BSP_LED_H_

#include "./SYSTEM/sys/sys.h"


/* 供外部调用的函数声明 */
void bsp_InitLed(void);	// 初始化函数
void led_all_on(void);

void led_all_off(void);

void led_test(void);

#endif
/******************************************  (END OF FILE) **********************************************/
