/**
 ****************************************************************************************************
 * @file        rs485.h
 * @author      正点原子团队(ALIENTEK)
 * @version     V1.0
 * @date        2022-09-06
 * @brief       RS485 驱动代码
 * @license     Copyright (c) 2020-2032, 广州市星翼电子科技有限公司
 ****************************************************************************************************
 */

#ifndef __BSP_USART3_H
#define __BSP_USART3_H

#include "./SYSTEM/sys/sys.h"


/******************************************************************************************/

/******************************************************************************************/
void bsp_InitRs485(uint32_t baudrate);
void bsp_InitUsart3(uint32_t bound);
void usart3_send_data(uint8_t *buf, uint8_t len);
 
void uart3_test(void);

#endif
