/**
 ****************************************************************************************************
 * @file        rs485.h
 * @author      正点原子团队(ALIENTEK)
 * @version     V1.0
 * @date        2022-09-06
 * @brief       RS485 驱动代码
 * @license     Copyright (c) 2020-2032, 广州市星翼电子科技有限公司
 ****************************************************************************************************
 */

#ifndef __BSP_LPUART1_H
#define __BSP_LPUART1_H

#include "./SYSTEM/sys/sys.h"


/******************************************************************************************/

/******************************************************************************************/

void bsp_InitLpuart1(uint32_t bound);
void Lpuart1_Send_Data(uint8_t *buf, uint16_t len);
 
void lpuart1_test(void);

#endif
